In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/test.csv", index_col=0)
df.head()

     국어  수학  영어  학생번호
이름
가영   83  89  76  A001
나미   66  93  75  B001
다윤  100  84  96  B002
라희   60  73  40  A002
미선   92  62  84  C001

In [3]:
df.columns

Index(['국어', '수학', '영어', '학생번호'], dtype='object')

In [4]:
df.index

Index(['가영', '나미', '다윤', '라희', '미선', '보민'], dtype='object', name='이름')

In [5]:
# 열명을 리스트로 변환한다
list1 = [i for i in df.columns]
print(list1)

['국어', '수학', '영어', '학생번호']

In [6]:
# 인텍스명을 리스트로 변환한다

In [7]:
list2 = [i for i in df.index]
print(list2)

['가영', '나미', '다윤', '라희', '미선', '보민']

In [8]:
df.dtypes

국어       int64
수학       int64
영어       int64
학생번호    object
dtype: object

In [9]:
len(df)

6

In [11]:
df["국어"]

이름
가영     83
나미     66
다윤    100
라희     60
미선     92
보민     96
Name: 국어, dtype: int64

In [12]:
df[["국어", "수학"]]

     국어  수학
이름
가영   83  89
나미   66  93
다윤  100  84
라희   60  73
미선   92  62
보민   96  92

In [13]:
df.iloc[0]

국어        83
수학        89
영어        76
학생번호    A001
Name: 가영, dtype: object

In [14]:
df.iloc[[0, 3]]

    국어  수학  영어  학생번호
이름
가영  83  89  76  A001
라희  60  73  40  A002